INSERT INTO users (user_id, name, password, email)
VALUES ('javajigi', '자바지기', 'test', 'javajigi@slipp.net');
INSERT INTO users (user_id, name, password, email)
VALUES ('sanjigi', '산지기', 'test', 'sanjigi@slipp.net');

INSERT INTO article (user_id, writer, title, contents, created_at, updated_at)
VALUES (1, 'javajigi', '제목 1', '내용 1', '2025-08-09 10:00:00', NULL),
       (1, 'javajigi', '제목 2', '내용 2', '2025-08-09 10:10:00', NULL),
       (2, 'sanjigi', '제목 3', '내용 3', '2025-08-09 10:20:00', NULL),
       (2, 'sanjigi', '제목 4', '내용 4', '2025-08-09 10:30:00', NULL),
       (1, 'javajigi', '제목 5', '내용 5', '2025-08-09 10:40:00', NULL),
       (1, 'javajigi', '제목 6', '내용 6', '2025-08-09 10:50:00', NULL),
       (2, 'sanjigi', '제목 7', '내용 7', '2025-08-09 11:00:00', NULL),
       (2, 'sanjigi', '제목 8', '내용 8', '2025-08-09 11:10:00', NULL),
       (1, 'javajigi', '제목 9', '내용 9', '2025-08-09 11:20:00', NULL),
       (1, 'javajigi', '제목 10', '내용 10', '2025-08-09 11:30:00', NULL),
       (2, 'sanjigi', '제목 11', '내용 11', '2025-08-09 11:40:00', NULL),
       (2, 'sanjigi', '제목 12', '내용 12', '2025-08-09 11:50:00', NULL),
       (1, 'javajigi', '제목 13', '내용 13', '2025-08-09 12:00:00', NULL),
       (1, 'javajigi', '제목 14', '내용 14', '2025-08-09 12:10:00', NULL),
       (2, 'sanjigi', '제목 15', '내용 15', '2025-08-09 12:20:00', NULL),
       (2, 'sanjigi', '제목 16', '내용 16', '2025-08-09 12:30:00', NULL),
       (1, 'javajigi', '제목 17', '내용 17', '2025-08-09 12:40:00', NULL),
       (1, 'javajigi', '제목 18', '내용 18', '2025-08-09 12:50:00', NULL),
       (2, 'sanjigi', '제목 19', '내용 19', '2025-08-09 13:00:00', NULL),
       (2, 'sanjigi', '제목 20', '내용 20', '2025-08-09 13:10:00', NULL),
       (1, 'javajigi', '제목 21', '내용 21', '2025-08-09 13:20:00', NULL),
       (1, 'javajigi', '제목 22', '내용 22', '2025-08-09 13:30:00', NULL),
       (2, 'sanjigi', '제목 23', '내용 23', '2025-08-09 13:40:00', NULL),
       (2, 'sanjigi', '제목 24', '내용 24', '2025-08-09 13:50:00', NULL),
       (1, 'javajigi', '제목 25', '내용 25', '2025-08-09 14:00:00', NULL),
       (1, 'javajigi', '제목 26', '내용 26', '2025-08-09 14:10:00', NULL),
       (2, 'sanjigi', '제목 27', '내용 27', '2025-08-09 14:20:00', NULL),
       (2, 'sanjigi', '제목 28', '내용 28', '2025-08-09 14:30:00', NULL),
       (1, 'javajigi', '제목 29', '내용 29', '2025-08-09 14:40:00', NULL),
       (1, 'javajigi', '제목 30', '내용 30', '2025-08-09 14:50:00', NULL),
       (1, 'javajigi', '제목 31', '내용 31', '2025-08-09 15:30:00', NULL),
       (1, 'javajigi', '제목 32', '내용 32', '2025-08-09 15:40:00', NULL);

INSERT INTO reply (article_id, user_id, contents, created_at, updated_at)
VALUES (1, 1, '댓글 내용 1', '2025-08-10 10:00:00', NULL),
       (1, 2, '댓글 내용 2', '2025-08-10 10:05:00', NULL),
       (1, 1, '댓글 내용 3', '2025-08-10 10:10:00', NULL),
       (1, 2, '댓글 내용 4', '2025-08-10 10:15:00', NULL),
       (1, 1, '댓글 내용 5', '2025-08-10 10:20:00', NULL),
       (1, 2, '댓글 내용 6', '2025-08-10 10:25:00', NULL),
       (1, 1, '댓글 내용 7', '2025-08-10 10:30:00', NULL),
       (1, 2, '댓글 내용 8', '2025-08-10 10:35:00', NULL),
       (1, 1, '댓글 내용 9', '2025-08-10 10:40:00', NULL),
       (1, 2, '댓글 내용 10', '2025-08-10 10:45:00', NULL),
       (1, 1, '댓글 내용 11', '2025-08-10 10:50:00', NULL),
       (1, 2, '댓글 내용 12', '2025-08-10 10:55:00', NULL);